{
    "categories": [
      {
        "id": "1",
        "name": "raising",
        "image": "http://nlyouth.ca/images/hands.png",
        "color": "#ea2"
      },
      {
        "id": "2",
        "name": "Technology",
        "image": "http://www.pngall.com/wp-content/uploads/2016/07/Technology.png",
        "color": "#fca"
      },
      {
        "id": "3",
        "name": "Scientific",
        "image": "http://icons.iconarchive.com/icons/iconshock/real-vista-education/256/laboratory-icon.png",
        "color": "#81C341"
      },
      {
        "id": "4",
        "name": "Social Problems",
        "image": "http://www.freeiconspng.com/uploads/error-icon-32.png",
        "color": "#1bb"
      },
      {
        "id": "5",
        "name": "Scientific",
        "image": "http://www.freeiconspng.com/uploads/history-icon-png-32.png",
        "color": "#009688"
      },
      {
        "id": "6",
        "name": "Social Problems",
        "image": "https://d30y9cdsu7xlg0.cloudfront.net/png/337564-200.png",
        "color": "#E91E63"
      }
    ],
    "blogs": [
      {
        "id": 1,
        "userId": "1",
        "category": 2,
        "image": "http://cdn.moneycrashers.com/wp-content/uploads/2012/03/apple-imac-27.jpg",
        "title": "The Computer",
        "body": "Man has made several inventions. Computer is one of them. The computer has begun to control so many critical functions that today man is excessively proud about his invention. Today, the computer plays an important role in our lives and we are completely dependent on him.",
        "content": "Its has been commonly said that computer can never replace the human brain, as it is created by humans, but we can’t ignore the fact that computer is much more capable than human brain. There are many ways in which the computer has an edge over man. The computer has the capability to evaluate problems that man can hardly imagine.Even if a man can calculate the same problems as a computer, the computer can do it faster with 100% accuracy. The computer is clearly superior in many other aspects. In absolute speed of computation and retrieval of data, the computer is obviously by far the stronger. It has the capacity to handle things on a far bigger scale than the human brain could ever do. Measurements, results, applications can all be done to the smallest details, far beyond the human brains’s capabilities."
      },
      {
        "id": 2,
        "userId": "2",
        "image": "https://borgenproject.org/wp-content/uploads/Child-Labor-in-Vietnam.jpg",
        "category": 4,
        "title": "Child labour",
        "body": "The term ‘child labour’, as defined by International Labour Organization (ILO), is the work that deprives children of their childhood, their potential and their dignity, and that is harmful to physical and mental development.",
        "content": "According to ILO, children or adolescents who participate in work that does not affect their health and personal development or interfere with their schooling, is not child labour; rather it may generally be regarded as being something positive. Such harmless work includes activities such as helping their parents around the home, assisting family or earning pocket money outside school hours and over holidays. These kinds of activities, suggests ILO, may contribute to children’s development by providing them with skills and experience, and help to prepare them to be productive members of society during their adult life."
      },
      {
        "id": 3,
        "userId": "3",
        "category": 3,
        "image": "https://image.slidesharecdn.com/atoms-140825094048-phpapp01/95/introduction-to-atomic-energy-and-nuclear-reactors-1-638.jpg?cb=1408959736",
        "title": "Atomic Energy",
        "body": "Until World War II, the world was familiar with only mechanical, chemical, acoustic, thermal, optic magnetic and electrical form of energy.",
        "content": "How exactly is energy got from the atom? The atom is the tiniest speck of matter. Each atom has a central core called the nucleus, around which revolve the electrons. The nucleus is built up of two kinds of very minute particles called protons and neutrons. The electron has a negative electrical charge, the proton has an equal positive charge and the neutron has no charge.The nucleus of the radium atom constantly disintegrates ejecting alpha particles which are nuclei of helium atoms. This phenomenon is called radioactivity. Uranium is another radioactive element. In 1938 Hahn and Strassman bombarded uranium with neutrons and found traces of barium in the material"
      },
      {
        "id": 4,
        "userId": "3",
        "category": 1,
        "image": "https://www.lvusd.org/cms/lib/CA01930645/Centricity/Domain/724/character.png",
        "title": "Character Building",
        "body": "The word character when used it is generally attributed to an individual only.",
        "content": "The word character is generally used to indicate good character only. Each one of us possesses character – either good or bad as there are several hues and shades of character ranging from highest good to extreme bad. Except a few individuals who are either highly noble for extremely bad rest of the human beings fall in between these two ends. For example, Lord Ram stands on supreme good and whereas Ravana stands on the extreme bad end.Character to a certain extent is hereditary but it is built by acquiring a long list of virtues. The qualities like morality and discipline, honesty and integrity will power and courage, chastity and loyalty, sacrifice and self respect, kindness and truthfulness go a long way in building up a noble character. Practice of morality is a must for developing a good character because it teaches a person to distinguish good from bad and right from wrong. Another important virtue is discipline. Discipline breeds character. A person of high morality always practices truth and justice. Such qualities develop self- respect and strong will power; qualities contribute for the development of good character."
      },
      {
        "id": "5",
        "userId": "1",
        "category": 2,
        "image": "http://indianapublicmedia.org/amomentofscience/files/2016/03/amos_atmos-940x626.jpg",
        "title": "Ozone layer Depletion",
        "body": "Ozone is the layer of colourless gas that forms a protective covering in the Earth’s upper atmosphere.",
        "content": "The problem with the ozone layer is that when certain chemicals, such as chlorofluorocarbons, reach the stratosphere, they break down into chlorine and bromine, which react with the ozone and destroy it.The plan is to somehow clean the stratosphere and get rid of these chemicals. For example, some scientists have suggested using giant lasers on top of mountains to basically break apart harmful chemicals before they reach the stratosphere.That would be incredibly expensive, not to mention that the side effects aren’t clear yet. Scrubbing out the chemicals this way might end up causing serious environmental problems."
      }
    ],
    "comments": [
      {
        "postId": 1,
        "id": 1,
        "name": "Mostafa Nawara",
        "email": "Eliseo@gardner.biz",
        "body": "yes Computer is very useful and I can not do my work without.",
        "image": "https://www.polyvore.com/cgi/img-thing?.out=jpg&size=l&tid=48725108"
      },
      {
        "postId": 2,
        "id": 2,
        "name": "Hameed Gamal",
        "email": "Jayne_Kuhic@sydney.com",
        "body": "Great Article and very useful Thank you Antonette.",
        "image": "https://s-media-cache-ak0.pinimg.com/originals/4b/62/09/4b6209bd1b002e78b3b412f19e2f3ef7.jpg"
      },
      {
        "postId": 1,
        "id": 3,
        "name": "Mohamed Sobhy",
        "email": "Nikita@garfield.biz",
        "body": "yes I agree with you completely.",
        "image": "https://s-media-cache-ak0.pinimg.com/originals/ae/6d/ed/ae6ded5cf22849e4f6ed3201eccd93b6.jpg"
      },
      {
        "postId": 3,
        "id": 4,
        "name": "Heba Ahmad",
        "email": "Lew@alysha.tv",
        "body": "No I dont think so.",
        "image": "https://s-media-cache-ak0.pinimg.com/236x/ba/16/27/ba1627c43cda2a5122ecd2cf64190ea0--cruella-deville-saturday-night.jpg"
      },
      {
        "postId": 1,
        "id": 5,
        "name": "Mohamed Abuelwafa",
        "email": "Hayden@althea.biz",
        "body": "Amazing Article Thank you for sharing.",
        "image": "http://des.gearbest.com/uploads/2015/201504/heditor/201504160904173781.jpg"
      }
    ],
    "users": [
      {
        "id": 1,
        "name": "Leanne Graham",
        "username": "Bret",
        "email": "Sincere@april.biz",
        "address": {
          "facebook": "Kulas Light",
          "twitter": "Apt. 556",
          "instagram": "Gwenborough",
          "github": "92998-3874"
        },
        "phone": "1-770-736-8031 x56442",
        "website": "hildegard.org",
        "image": "https://cdn0.iconfinder.com/data/icons/avatars-3/512/avatar_beanie_girl-512.png"
      },
      {
        "id": 2,
        "name": "Ervin Howell",
        "username": "Antonette",
        "email": "Shanna@melissa.tv",
        "address": {
          "facebook": "Victor Plains",
          "twitter": "Suite 879",
          "instagram": "Wisokyburgh",
          "github": "90566-7771"
        },
        "phone": "010-692-6593 x09125",
        "website": "anastasia.net",
        "image": "https://thumbs.dreamstime.com/z/vector-illustration-cute-geek-girl-playing-video-game-blond-games-67045352.jpg"
      },
      {
        "id": 3,
        "name": "Clementine Bauch",
        "username": "Samantha",
        "email": "Nathan@yesenia.net",
        "address": {
          "facebook": "Douglas Extension",
          "twitter": "Suite 847",
          "instagram": "McKenziehaven",
          "github": "59590-4157"
        },
        "phone": "1-463-123-4447",
        "website": "ramiro.info",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSTUohuIZeKLSx5OR7Gv0EOqdxX90rQ0SaH23zt62uX-5b1Bn326A"
      }
    ]
  }